
### ADVENTURE WORKS CASE STUDY

The Adventure Works faces challenges in maximizing its sales potential due to insufficient understanding of intricate sales patterns, nuanced customer behavior, and diverse product perfomance. This project seeks to conduct a comprehensive analysis of sales data, customer demographics, and product details to uncover complex relationships and provide sophisticated insights.

### Dataset Information:

- **AdventureWorks.db:** This database contains information on sales made at Adventure Works.It consists of several tables containing data about customers, returns, products, sales and location



### Immediate Objective:

`To clean sql data with python in jupyter notebook 




#### Domain 
`Business, Sales and Marketing`

### Tasks Carried Out Below    
*Imported required libraries   
*Created connection to database file  
*Queried the data into Pandas dataframe  
*Queried the data into dataframe; Alternative method  
*Created an object cursor for easy execution of sql queries   
*Identified and Quick view of tables to determine preprocessing required   
*Identified missing data   
*Adjusted data types to ensure compatibility   
*Eradicated redundancy by removing duplicate data   
*Did a quick evaluation of data

# Setting up SQLite Database Connection With Python

In [113]:
#IMPORT LIBRARIES
import pandas as pd
import numpy as np
import sqlite3 as sql

In [2]:
#Create connection to database file
database="Adventure_Works.db"
connection= sql.connect(database)

In [3]:
# Query the data into Pandas dataframe: Method1
query="SELECT* FROM AdventureWorks_Sales"
df= pd.read_sql_query(query,connection)
df.head()

,Sales ID,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,TerritoryKey,OrderLineItem,OrderQuantity
0,1,1/1/2015,9/21/2001,SO45080,332,14657,1,1,1
1,2,1/1/2015,12/5/2001,SO45079,312,29255,4,1,1
2,3,1/1/2015,10/29/2001,SO45082,350,11455,9,1,1
3,4,1/1/2015,11/16/2001,SO45081,338,26782,6,1,1
4,5,1/2/2015,12/15/2001,SO45083,312,14947,10,1,1

In [5]:
#Query the data into dataframe: Method2
#Alternatively, we can query data by installing ipython-sql library
!pip3 install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\user\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: ipython in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (7.22.0)
Requirement already satisfied: ipython-genutils in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: sqlparse in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (2.0.35)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.0.0)
Requirement already satisfied: pickleshare in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.17.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.17)
Requirement already satisfied: decorator in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.0.6)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.4)
Requirement already satisfied: traitlets>=4.2 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.0.5)
Requirement already satisfied: pygments in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.8.1)
Requirement already satisfied: backcall in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (52.0.0.post20210125)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\user\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\user\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)

In [25]:
%reload_ext sql
%sql sqlite:///Adventure_Works.db

In [26]:
%%sql
SELECT*
FROM AdventureWorks_Sales WHERE OrderNumber="SO45080";

 * sqlite:///Adventure_Works.db
Done.

[(1, '1/1/2015', '9/21/2001', 'SO45080', 332, 14657, 1, 1, 1)]

In [32]:
%%sql
SELECT name
FROM sys.tables

 * sqlite:///Adventure_Works.db
(sqlite3.OperationalError) no such table: sys.tables
[SQL: SELECT name
FROM sys.tables]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [19]:
#Using an object cursor to execute sql queries
cursor = connection.cursor()

In [21]:
#testing cursor
rows= cursor.execute("SELECT* FROM AdventureWorks_Product_Categories").fetchall()
print(rows)

[(1, 'Bikes'), (2, 'Components'), (3, 'Clothing'), (4, 'Accessories')]

In [22]:
rows = cursor.execute("SELECT* FROM AdventureWorks_Sales WHERE OrderNumber= 'SO45080'").fetchall()
print(rows)

[(1, '1/1/2015', '9/21/2001', 'SO45080', 332, 14657, 1, 1, 1)]

In [41]:
#View all tables available in the database
rows = cursor.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
print(rows)

[('AdventureWorks_Sales_2015',), ('AdventureWorks_Sales_2016',), ('AdventureWorks_Sales_2017',), ('AdventureWorks_Customers',), ('AdventureWorks_Calendar',), ('AdventureWorks_Territories',), ('AdventureWorks_Products',), ('AdventureWorks_Returns',), ('AdventureWorks_Product_Subcategories',), ('AdventureWorks_Product_Categories',), ('AdventureWorks_Sales',)]

# Data Preprocessing and Validation

In [30]:
#Veryfying data types to ensure compatibility 
#Identifying Missing Data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56046 entries, 0 to 56045
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales ID       56046 non-null  int64
 1   OrderDate      56046 non-null  object
 2   StockDate      56046 non-null  object
 3   OrderNumber    56046 non-null  object
 4   ProductKey     56046 non-null  int64
 5   CustomerKey    56046 non-null  int64
 6   TerritoryKey   56046 non-null  int64
 7   OrderLineItem  56046 non-null  int64
 8   OrderQuantity  56046 non-null  int64
dtypes: int64(6), object(3)
memory usage: 3.8+ MB

In [42]:
df_Customers=pd.read_sql_query('SELECT*FROM AdventureWorks_Customers',connection)

In [43]:
df_Customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18148 entries, 0 to 18147
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerKey     18148 non-null  int64
 1   Prefix          18018 non-null  object
 2   FirstName       18148 non-null  object
 3   LastName        18148 non-null  object
 4   BirthDate       18148 non-null  object
 5   MaritalStatus   18148 non-null  object
 6   Gender          18148 non-null  object
 7   EmailAddress    18148 non-null  object
 8   AnnualIncome    18148 non-null  object
 9   TotalChildren   18148 non-null  int64
 10  EducationLevel  18148 non-null  object
 11  Occupation      18148 non-null  object
 12  HomeOwner       18148 non-null  object
dtypes: int64(2), object(11)
memory usage: 1.8+ MB

In [44]:
df_Products= pd.read_sql_query("SELECT*FROM Adventureworks_Products", connection)

In [46]:
df_Products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293 entries, 0 to 292
Data columns (total 11 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductKey             293 non-null    int64
 1   ProductSubcategoryKey  293 non-null    int64
 2   ProductSKU             293 non-null    object
 3   ProductName            293 non-null    object
 4   ModelName              293 non-null    object
 5   ProductDescription     293 non-null    object
 6   ProductColor           293 non-null    object
 7   ProductSize            293 non-null    object
 8   ProductStyle           293 non-null    object
 9   ProductCost            293 non-null    float64
 10  ProductPrice           293 non-null    float64
dtypes: float64(2), int64(2), object(7)
memory usage: 25.3+ KB

In [47]:
df_Returns = pd.read_sql_query('SELECT*FROM AdventureWorks_Returns',connection)

In [48]:
df_Returns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1809 entries, 0 to 1808
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ReturnDate      1809 non-null   object
 1   TerritoryKey    1809 non-null   int64
 2   ProductKey      1809 non-null   int64
 3   ReturnQuantity  1809 non-null   int64
dtypes: int64(3), object(1)
memory usage: 56.7+ KB

In [49]:
df_Calendar = pd.read_sql_query('SELECT*FROM AdventureWorks_Calendar',connection)

In [50]:
df_Calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 912 entries, 0 to 911
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    912 non-null    object
dtypes: object(1)
memory usage: 7.2+ KB

In [51]:
df_Product_Categories = pd.read_sql_query('SELECT*FROM AdventureWorks_Product_Categories',connection)

In [52]:
df_Product_Categories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ProductCategoryKey  4 non-null      int64
 1   CategoryName        4 non-null      object
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [53]:
df_ProductSubCategory = pd.read_sql_query('SELECT*FROM AdventureWorks_Product_Subcategories',connection)

In [54]:
df_ProductSubCategory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37 entries, 0 to 36
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductSubcategoryKey  37 non-null     int64
 1   SubcategoryName        37 non-null     object
 2   ProductCategoryKey     37 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1016.0+ bytes

In [55]:
df_Territories = pd.read_sql_query("SELECT* FROM AdventureWorks_Territories", connection)

In [56]:
df_Territories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   SalesTerritoryKey  10 non-null     int64
 1   Region             10 non-null     object
 2   Country            10 non-null     object
 3   Continent          10 non-null     object
dtypes: int64(1), object(3)
memory usage: 448.0+ bytes

# Summary
*The Prefix column of the AdventureWorks_Customers table has 130 null values;Most likely customers who didnt attach a prefix to their names                     
*No other table had missing values                            
*All date values where stored using the 'Object" data type                    
*All other data types where compatible

In [71]:
#CHECKING FOR DUPLICATE ROWS IN INDEPENDENT TABLES
rowz= cursor.execute("SELECT* FROM AdventureWorks_Products GROUP BY ProductKey HAVING COUNT(*) > 1").fetchall()
print(rowz)

[]

In [81]:
rowz= cursor.execute("SELECT* FROM AdventureWorks_Product_Subcategories GROUP BY ProductSubcategoryKey HAVING COUNT(*) > 1").fetchall()
print(rowz)

[]

In [72]:
rowz = cursor.execute("SELECT* FROM AdventureWorks_Customers GROUP BY CustomerKey HAVING COUNT(*) > 1").fetchall()
print(rowz)

[]

In [85]:
rowz= cursor.execute("SELECT* FROM AdventureWorks_Product_Categories GROUP BY ProductCategoryKey HAVING COUNT(*) > 1").fetchall()
print(rowz)

[]

In [83]:
rowz= cursor.execute("SELECT* FROM AdventureWorks_Calendar GROUP BY Date HAVING COUNT(*) > 1").fetchall()
print(rowz)

[]

In [87]:
rowz= cursor.execute("SELECT* FROM AdventureWorks_Territories GROUP BY SalesTerritoryKey HAVING COUNT(*) > 1").fetchall()
print(rowz)

[]

No duplicate data in the independent tables

# Removing Redundancy

In [93]:
#Remove sales 2015, sales 2016 and sales 2017 that reflected in the db
cursor.execute("DROP TABLE AdventureWorks_Sales_2016")
cursor.execute("DROP TABLE AdventureWorks_Sales_2017")
print ("2015,2016,2017 tables dropped")

2015,2016,2017 tables dropped

In [96]:
#Delete prefix column from the AdventureWorks_Customers table
cursor.execute("ALTER TABLE AdventureWorks_Customers DROP COLUMN Prefix")
print("Prefix column deleted")

Prefix column deleted

*We deleted the prefix column from the Customer table as it had 130 missing values and is generally not required for the analysis
*We also deleted the sales 2015, sales 2016 and sales 2017 tables as they are a replica of the combined sales table

# Fixing DateTime Values

In [112]:
#Changing the data type of the Date columns from object to DateTime format
#AdventureWorks_Sales
df['OrderDate'] = pd.to_datetime(df['OrderDate'],format = '%d/%m/%Y',  errors= 'coerce')
df['StockDate'] = pd.to_datetime(df['StockDate'],format = '%d/%m/%Y', errors= 'coerce')

#AdventureWorks_Customers
df_Customers['BirthDate'] = pd.to_datetime(df_Customers['BirthDate'], format = '%d/%m/%Y', errors= 'coerce')

#AdventureWorks_Calendar
df_Calendar['Date'] = pd.to_datetime(df_Calendar['Date'],format = '%d/%m/%Y', errors= 'coerce')

#AdventureWorks_Returns
df_Returns['ReturnDate'] = pd.to_datetime(df_Returns['ReturnDate'],format = '%d/%m/%Y', errors= 'coerce')

In [115]:
#Quick Evaluation of Product data
df_Products.describe()

       ProductKey  ProductSubcategoryKey  ProductCost  ProductPrice
count  293.000000             293.000000   293.000000    293.000000
mean   441.552901              12.283276   413.661009    714.437357
std    108.064327               9.892831   517.611849    872.157258
min    214.000000               1.000000     0.856500      2.290000
25%    354.000000               2.000000    31.724400     63.500000
50%    457.000000              12.000000   199.375700    333.420000
75%    533.000000              17.000000   601.743700   1003.910000
max    606.000000              37.000000  2171.294200   3578.270000

In [116]:
connection.commit()

In [119]:
pwd

'C:\\Users\\user\\Desktop\\3Signet Week1 Task'